---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.IsWallJoinedToTop(Autodesk.Revit.DB.Wall)
source: html/86bd03c3-b537-87d3-c46c-83d863f5f746.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.IsWallJoinedToTop Method

Checks if wall is joined to top.

## Syntax (C#)
```csharp
public static bool IsWallJoinedToTop(
	Wall wall
)
```

## Parameters
- **wall** (`Autodesk.Revit.DB.Wall`) - The wall.

## Returns
True if wall is joined to top, false if not.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null